MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
extern volatile CCP3CON2LBITS CCP3CON2Lbits __attribute__((__sfr__));

#define CCP3CON2H CCP3CON2H
extern volatile uint16_t CCP3CON2H __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON2HBITS {
  union {
    struct {
      uint16_t ICS:3;
      uint16_t AUXOUT:2;
      uint16_t :1;
      uint16_t ICGSM:2;
      uint16_t OCAEN:1;
      uint16_t OCBEN:1;
      uint16_t :5;
      uint16_t OENSYNC:1;
    };
    struct {
      uint16_t ICS0:1;
      uint16_t ICS1:1;
      uint16_t ICS2:1;
      uint16_t AUXOUT0:1;
      uint16_t AUXOUT1:1;
      uint16_t :1;
      uint16_t ICGSM0:1;
      uint16_t ICGSM1:1;
    };
    struct {
      uint16_t ICSEL:3;
    };
    struct {
      uint16_t ICSEL0:1;
      uint16_t ICSEL1:1;
      uint16_t ICSEL2:1;
    };
  };
} CCP3CON2HBITS;
extern volatile CCP3CON2HBITS CCP3CON2Hbits __attribute__((__sfr__));

#define CCP3CON3H CCP3CON3H
extern volatile uint16_t CCP3CON3H __attribute__((__sfr__));
__extension__ typedef struct tagCCP3CON3HBITS {
  union {
    struct {
      uint16_t PSSBDF:2;
      uint16_t PSSACE:2;
      uint16_t POLBDF:1;
      uint16_t POLACE:1;
      uint16_t :2;
      uint16_t OUTM:3;
      uint16_t :1;
      uint16_t OSCNT:3;
      uint16_t OETRIG:1;
    };
    struct {
      uint16_t PSSBDF0:1;
      uint16_t PSSBDF1:1;
      uint16_t PSSACE0:1;
      uint16_t PSSACE1:1;
      uint16_t :4;
      uint16_t OUTM0:1;
      uint16_t OUTM1:1;
      uint16_t OUTM2:1;
      uint16_t :1;
      uint16_t OSCNT0:1;
      uint16_t OSCNT1:1;
      uint16_t OSCNT2:1;
    };
  };
} CCP3CON3HBITS;
extern volatile CCP3CON3HBITS CCP3CON3Hbits __attribute__((__sfr__));

#define CCP3STAT CCP3STAT
extern volatile uint16_t CCP3STAT __attribute__((__sfr__));
__extension__ typedef struct tagCCP3STATBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP3STATBITS;
extern volatile CCP3STATBITS CCP3STATbits __attribute__((__sfr__));

#define CCP3STATL CCP3STATL
extern volatile uint16_t CCP3STATL __attribute__((__sfr__));
__extension__ typedef struct tagCCP3STATLBITS {
  union {
    struct {
      uint16_t ICBNE:1;
      uint16_t ICOV:1;
      uint16_t ICDIS:1;
      uint16_t SCEVT:1;
      uint16_t ASEVT:1;
      uint16_t TRCLR:1;
      uint16_t TRSET:1;
      uint16_t CCPTRIG:1;
      uint16_t :2;
      uint16_t ICGARM:1;
    };
    struct {
      uint16_t :7;
      uint16_t TRIG:1;
    };
  };
} CCP3STATLBITS;
extern volatile CCP3STATLBITS CCP3STATLbits __attribute__((__sfr__));

#define CCP3STATH CCP3STATH
extern volatile uint16_t CCP3STATH __attribute__((__sfr__));
typedef struct tagCCP3STATHBITS {
  uint16_t RAWIP:1;
  uint16_t RBWIP:1;
  uint16_t TMRLWIP:1;
  uint16_t TMRHWIP:1;
  uint16_t PRLWIP:1;
} CCP3STATHBITS;
extern volatile CCP3STATHBITS CCP3STATHbits __attribute__((__sfr__));

#define CCP3TMRL CCP3TMRL
extern volatile uint16_t CCP3TMRL __attribute__((__sfr__));
#define CCP3TMRH CCP3TMRH
extern volatile uint16_t CCP3TMRH __attribute__((__sfr__));
#define CCP3PRL CCP3PRL
extern volatile uint16_t CCP3PRL __attribute__((__sfr__));
#define CCP3PRH CCP3PRH
extern volatile uint16_t CCP3PRH __attribute__((__sfr__));
#define CCP3RA CCP3RA
extern volatile uint16_t CCP3RA __attribute__((__sfr__));
#define CCP3RAL CCP3RAL
extern volatile uint16_t CCP3RAL __attribute__((__sfr__));
#define CCP3RAH CCP3RAH
extern volatile uint16_t CCP3RAH __attribute__((__sfr__));
#define CCP3RB CCP3RB
extern volatile uint16_t CCP3RB __attribute__((__sfr__));
#define CCP3RBL CCP3RBL
extern volatile uint16_t CCP3RBL __attribute__((__sfr__));
#define CCP3RBH CCP3RBH
extern volatile uint16_t CCP3RBH __attribute__((__sfr__));
#define CCP3BUFL CCP3BUFL
extern volatile uint16_t CCP3BUFL __attribute__((__sfr__));
#define CCP3BUFH CCP3BUFH
extern volatile uint16_t CCP3BUFH __attribute__((__sfr__));
#define CMSTAT CMSTAT
extern volatile uint16_t CMSTAT __attribute__((__sfr__));
__extension__ typedef struct tagCMSTATBITS {
  union {
    struct {
      uint16_t C1OUT:1;
      uint16_t C2OUT:1;
      uint16_t C3OUT:1;
      uint16_t :5;
      uint16_t C1EVT:1;
      uint16_t C2EVT:1;
      uint16_t C3EVT:1;
      uint16_t :4;
      uint16_t CMIDL:1;
    };
    struct {
      uint16_t :15;
      uint16_t CMSIDL:1;
    };
  };
} CMSTATBITS;
extern volatile CMSTATBITS CMSTATbits __attribute__((__sfr__));

#define CVRCON CVRCON
extern volatile uint16_t CVRCON __attribute__((__sfr__));
__extension__ typedef struct tagCVRCONBITS {
  union {
    struct {
      uint16_t CVR:5;
      uint16_t CVRSS:1;
      uint16_t CVROE:1;
      uint16_t CVREN:1;
      uint16_t CVREFM:2;
      uint16_t CVREFP:1;
    };
    struct {
      uint16_t CVR0:1;
      uint16_t CVR1:1;
      uint16_t CVR2:1;
      uint16_t CVR3:1;
      uint16_t CVR4:1;
      uint16_t :3;
      uint16_t CVREFM0:1;
      uint16_t CVREFM1:1;
    };
  };
} CVRCONBITS;
extern volatile CVRCONBITS CVRCONbits __attribute__((__sfr__));

#define CM1CON CM1CON
extern volatile uint16_t CM1CON __attribute__((__sfr__));
__extension__ typedef struct tagCM1CONBITS {
  union {
    struct {
      uint16_t CCH:2;
      uint16_t :2;
      uint16_t CREF:1;
      uint16_t :1;
      uint16_t EVPOL:2;
      uint16_t COUT:1;
      uint16_t CEVT:1;
      uint16_t :3;
      uint16_t CPOL:1;
      uint16_t COE:1;
      uint16_t CON:1;
    };
    struct {
      uint16_t CCH0:1;
      uint16_t CCH1:1;
      uint16_t :4;
      uint16_t EVPOL0:1;
      uint16_t EVPOL1:1;
      uint16_t :7;
      uint16_t CEN:1;
    };
  };
} CM1CONBITS;
extern volatile CM1CONBITS CM1CONbits __attribute__((__sfr__));

#define CM2CON CM2CON
extern volatile uint16_t CM2CON __attribute__((__sfr__));
__extension__ typedef struct tagCM2CONBITS {
  union {
    struct {
      uint16_t CCH:2;
      uint16_t :2;
      uint16_t CREF:1;
      uint16_t :1;
      uint16_t EVPOL:2;
      uint16_t COUT:1;
      uint16_t CEVT:1;
      uint16_t :3;
      uint16_t CPOL:1;
      uint16_t COE:1;
      uint16_t CON:1;
    };
    struct {
      uint16_t CCH0:1;
      uint16_t CCH1:1;
      uint16_t :4;
      uint16_t EVPOL0:1;
      uint16_t EVPOL1:1;
      uint16_t :7;
      uint16_t CEN:1;
    };
  };
} CM2CONBITS;
