MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
/* CCP4STAT */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICDIS cannot be defined because it is used by more than one SFR */
/* Bitname _SCEVT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEVT cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _CCPTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _ICGARM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */

/* CCP4STATL */
/* Bitname _ICBNE cannot be defined because it is used by more than one SFR */
/* Bitname _ICOV cannot be defined because it is used by more than one SFR */
/* Bitname _ICDIS cannot be defined because it is used by more than one SFR */
/* Bitname _SCEVT cannot be defined because it is used by more than one SFR */
/* Bitname _ASEVT cannot be defined because it is used by more than one SFR */
/* Bitname _TRCLR cannot be defined because it is used by more than one SFR */
/* Bitname _TRSET cannot be defined because it is used by more than one SFR */
/* Bitname _CCPTRIG cannot be defined because it is used by more than one SFR */
/* Bitname _ICGARM cannot be defined because it is used by more than one SFR */
/* Bitname _TRIG cannot be defined because it is used by more than one SFR */

/* CCP4STATH */
/* Bitname _RAWIP cannot be defined because it is used by more than one SFR */
/* Bitname _RBWIP cannot be defined because it is used by more than one SFR */
/* Bitname _TMRLWIP cannot be defined because it is used by more than one SFR */
/* Bitname _TMRHWIP cannot be defined because it is used by more than one SFR */
/* Bitname _PRLWIP cannot be defined because it is used by more than one SFR */

/* U1MODE */
#define _STSEL U1MODEbits.STSEL
#define _PDSEL U1MODEbits.PDSEL
#define _BRGH U1MODEbits.BRGH
#define _URXINV U1MODEbits.URXINV
#define _ABAUD U1MODEbits.ABAUD
#define _LPBACK U1MODEbits.LPBACK
#define _WAKE U1MODEbits.WAKE
#define _UEN U1MODEbits.UEN
#define _RTSMD U1MODEbits.RTSMD
#define _IREN U1MODEbits.IREN
#define _USIDL U1MODEbits.USIDL
#define _UARTEN U1MODEbits.UARTEN
#define _PDSEL0 U1MODEbits.PDSEL0
#define _PDSEL1 U1MODEbits.PDSEL1
#define _RXINV U1MODEbits.RXINV
#define _UEN0 U1MODEbits.UEN0
#define _UEN1 U1MODEbits.UEN1

/* U1STA */
#define _URXDA U1STAbits.URXDA
#define _OERR U1STAbits.OERR
#define _FERR U1STAbits.FERR
#define _PERR U1STAbits.PERR
#define _RIDLE U1STAbits.RIDLE
#define _ADDEN U1STAbits.ADDEN
#define _URXISEL U1STAbits.URXISEL
#define _TRMT U1STAbits.TRMT
#define _UTXBF U1STAbits.UTXBF
#define _UTXEN U1STAbits.UTXEN
#define _UTXBRK U1STAbits.UTXBRK
#define _URXEN U1STAbits.URXEN
#define _UTXISEL0 U1STAbits.UTXISEL0
#define _UTXINV U1STAbits.UTXINV
#define _UTXISEL1 U1STAbits.UTXISEL1
#define _URXISEL0 U1STAbits.URXISEL0
#define _URXISEL1 U1STAbits.URXISEL1

/* U1TXREG */
#define _LAST U1TXREGbits.LAST

/* U1ADMD */
/* Bitname _ADMADDR cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMADDR7 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK0 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK1 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK2 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK3 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK4 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK5 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK6 cannot be defined because it is used by more than one SFR */
/* Bitname _ADMMASK7 cannot be defined because it is used by more than one SFR */

/* U1SCCON */
/* Bitname _SCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PTRCL cannot be defined because it is used by more than one SFR */
/* Bitname _T0PD cannot be defined because it is used by more than one SFR */
/* Bitname _CONV cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPT1 cannot be defined because it is used by more than one SFR */

/* U1SCINT */
/* Bitname _GTCIE cannot be defined because it is used by more than one SFR */
/* Bitname _WTCIE cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPTIE cannot be defined because it is used by more than one SFR */
/* Bitname _RXRPTIE cannot be defined because it is used by more than one SFR */
/* Bitname _PARIE cannot be defined because it is used by more than one SFR */
/* Bitname _GTCIF cannot be defined because it is used by more than one SFR */
/* Bitname _WTCIF cannot be defined because it is used by more than one SFR */
/* Bitname _TXRPTIF cannot be defined because it is used by more than one SFR */
/* Bitname _RXRPTIF cannot be defined because it is used by more than one SFR */

/* U1GTC */
/* Bitname _GTC cannot be defined because it is used by more than one SFR */
/* Bitname _GTC0 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC1 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC2 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC3 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC4 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC5 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC6 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC7 cannot be defined because it is used by more than one SFR */
/* Bitname _GTC8 cannot be defined because it is used by more than one SFR */

/* U1WTCL */
/* Bitname _WTCL cannot be defined because it is used by more than one SFR */
/* Bitname _WTC0 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC1 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC2 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC3 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC4 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC5 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC6 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC7 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC8 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC9 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC10 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC11 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC12 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC13 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC14 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC15 cannot be defined because it is used by more than one SFR */

/* U1WTCH */
/* Bitname _WTCH cannot be defined because it is used by more than one SFR */
/* Bitname _WTC16 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC17 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC18 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC19 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC20 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC21 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC22 cannot be defined because it is used by more than one SFR */
/* Bitname _WTC23 cannot be defined because it is used by more than one SFR */

/* U2MODE */
/* Bitname _STSEL cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL cannot be defined because it is used by more than one SFR */
/* Bitname _BRGH cannot be defined because it is used by more than one SFR */
/* Bitname _URXINV cannot be defined because it is used by more than one SFR */
/* Bitname _ABAUD cannot be defined because it is used by more than one SFR */
/* Bitname _LPBACK cannot be defined because it is used by more than one SFR */
/* Bitname _WAKE cannot be defined because it is used by more than one SFR */
/* Bitname _UEN cannot be defined because it is used by more than one SFR */
/* Bitname _RTSMD cannot be defined because it is used by more than one SFR */
/* Bitname _IREN cannot be defined because it is used by more than one SFR */
/* Bitname _USIDL cannot be defined because it is used by more than one SFR */
/* Bitname _UARTEN cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _PDSEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UEN0 cannot be defined because it is used by more than one SFR */
/* Bitname _UEN1 cannot be defined because it is used by more than one SFR */

/* U2STA */
/* Bitname _URXDA cannot be defined because it is used by more than one SFR */
/* Bitname _OERR cannot be defined because it is used by more than one SFR */
/* Bitname _FERR cannot be defined because it is used by more than one SFR */
/* Bitname _PERR cannot be defined because it is used by more than one SFR */
/* Bitname _RIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _ADDEN cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL cannot be defined because it is used by more than one SFR */
/* Bitname _TRMT cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBF cannot be defined because it is used by more than one SFR */
/* Bitname _UTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXBRK cannot be defined because it is used by more than one SFR */
/* Bitname _URXEN cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _UTXINV cannot be defined because it is used by more than one SFR */
/* Bitname _UTXISEL1 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL0 cannot be defined because it is used by more than one SFR */
/* Bitname _URXISEL1 cannot be defined because it is used by more than one SFR */

