MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
/* SPI2CON2L */
/* Bitname _WLENGTH cannot be defined because it is used by more than one SFR */

/* SPI2CON3 */
/* Bitname _WLENGTH cannot be defined because it is used by more than one SFR */

/* SPI2STATL */
/* Bitname _SPIRBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBF cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBE cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROV cannot be defined because it is used by more than one SFR */
/* Bitname _SRMT cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUR cannot be defined because it is used by more than one SFR */
/* Bitname _SPIBUSY cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERR cannot be defined because it is used by more than one SFR */

/* SPI2STATH */
/* Bitname _TXELM cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXELM5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXELM5 cannot be defined because it is used by more than one SFR */

/* SPI2BUFL */
#define _SPI2BUFL SPI2BUFLbits.SPI2BUFL
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI2BUFH */
#define _SPI2BUFH SPI2BUFHbits.SPI2BUFH
/* Bitname _DATA cannot be defined because it is used by more than one SFR */

/* SPI2BRGL */
#define _SPI2BRGL SPI2BRGLbits.SPI2BRGL
/* Bitname _BRG cannot be defined because it is used by more than one SFR */

/* SPI2IMSK1 */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

/* SPI2IMSKL */
/* Bitname _SPIRBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBFEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIRBEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPIROVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SRMTEN cannot be defined because it is used by more than one SFR */
/* Bitname _SPITUREN cannot be defined because it is used by more than one SFR */
/* Bitname _BUSYEN cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERREN cannot be defined because it is used by more than one SFR */

/* SPI2IMSK2 */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI2IMSKH */
/* Bitname _TXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _TXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK cannot be defined because it is used by more than one SFR */
/* Bitname _RXWIEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _TXMSK5 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK0 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK1 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK2 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK3 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK4 cannot be defined because it is used by more than one SFR */
/* Bitname _RXMSK5 cannot be defined because it is used by more than one SFR */

/* SPI2URDTL */
#define _SPI2URDTL SPI2URDTLbits.SPI2URDTL
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* SPI2URDTH */
#define _SPI2URDTH SPI2URDTHbits.SPI2URDTH
/* Bitname _URDATA cannot be defined because it is used by more than one SFR */

/* SPI3CON1 */
/* Bitname _ENHBUF cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFE cannot be defined because it is used by more than one SFR */
/* Bitname _MCLKEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDI cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE32 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _SPISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */

/* SPI3CON1L */
/* Bitname _ENHBUF cannot be defined because it is used by more than one SFR */
/* Bitname _SPIFE cannot be defined because it is used by more than one SFR */
/* Bitname _MCLKEN cannot be defined because it is used by more than one SFR */
/* Bitname _DISSCK cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDI cannot be defined because it is used by more than one SFR */
/* Bitname _MSTEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKP cannot be defined because it is used by more than one SFR */
/* Bitname _SSEN cannot be defined because it is used by more than one SFR */
/* Bitname _CKE cannot be defined because it is used by more than one SFR */
/* Bitname _SMP cannot be defined because it is used by more than one SFR */
/* Bitname _MODE16 cannot be defined because it is used by more than one SFR */
/* Bitname _MODE32 cannot be defined because it is used by more than one SFR */
/* Bitname _DISSDO cannot be defined because it is used by more than one SFR */
/* Bitname _SPISIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SPIEN cannot be defined because it is used by more than one SFR */
/* Bitname _MODE cannot be defined because it is used by more than one SFR */

