MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
/* LATB */
#define _LATB0 LATBbits.LATB0
#define _LATB1 LATBbits.LATB1
#define _LATB2 LATBbits.LATB2
#define _LATB3 LATBbits.LATB3
#define _LATB4 LATBbits.LATB4
#define _LATB5 LATBbits.LATB5
#define _LATB6 LATBbits.LATB6
#define _LATB7 LATBbits.LATB7
#define _LATB8 LATBbits.LATB8
#define _LATB9 LATBbits.LATB9
#define _LATB10 LATBbits.LATB10
#define _LATB11 LATBbits.LATB11
#define _LATB12 LATBbits.LATB12
#define _LATB13 LATBbits.LATB13
#define _LATB14 LATBbits.LATB14
#define _LATB15 LATBbits.LATB15

/* ODCB */
#define _ODCB0 ODCBbits.ODCB0
#define _ODCB1 ODCBbits.ODCB1
#define _ODCB2 ODCBbits.ODCB2
#define _ODCB3 ODCBbits.ODCB3
#define _ODCB4 ODCBbits.ODCB4
#define _ODCB5 ODCBbits.ODCB5
#define _ODCB6 ODCBbits.ODCB6
#define _ODCB7 ODCBbits.ODCB7
#define _ODCB8 ODCBbits.ODCB8
#define _ODCB9 ODCBbits.ODCB9
#define _ODCB10 ODCBbits.ODCB10
#define _ODCB11 ODCBbits.ODCB11
#define _ODCB12 ODCBbits.ODCB12
#define _ODCB13 ODCBbits.ODCB13
#define _ODCB14 ODCBbits.ODCB14
#define _ODCB15 ODCBbits.ODCB15

/* ANSB */
#define _ANSB0 ANSBbits.ANSB0
#define _ANSB1 ANSBbits.ANSB1
#define _ANSB2 ANSBbits.ANSB2
#define _ANSB3 ANSBbits.ANSB3
#define _ANSB9 ANSBbits.ANSB9
#define _ANSB12 ANSBbits.ANSB12
#define _ANSB13 ANSBbits.ANSB13
#define _ANSB14 ANSBbits.ANSB14
#define _ANSB15 ANSBbits.ANSB15
#define _ANSELB0 ANSBbits.ANSELB0
#define _ANSELB1 ANSBbits.ANSELB1
#define _ANSELB2 ANSBbits.ANSELB2
#define _ANSELB3 ANSBbits.ANSELB3
#define _ANSELB9 ANSBbits.ANSELB9
#define _ANSELB12 ANSBbits.ANSELB12
#define _ANSELB13 ANSBbits.ANSELB13
#define _ANSELB14 ANSBbits.ANSELB14
#define _ANSELB15 ANSBbits.ANSELB15

/* IOCPB */
/* Bitname _IOCPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB15 cannot be defined because it is used by more than one SFR */

/* IOCNB */
#define _IOCNB0 IOCNBbits.IOCNB0
#define _IOCNB1 IOCNBbits.IOCNB1
#define _IOCNB2 IOCNBbits.IOCNB2
#define _IOCNB3 IOCNBbits.IOCNB3
#define _IOCNB4 IOCNBbits.IOCNB4
#define _IOCNB5 IOCNBbits.IOCNB5
#define _IOCNB6 IOCNBbits.IOCNB6
#define _IOCNB7 IOCNBbits.IOCNB7
#define _IOCNB8 IOCNBbits.IOCNB8
#define _IOCNB9 IOCNBbits.IOCNB9
#define _IOCNB10 IOCNBbits.IOCNB10
#define _IOCNB11 IOCNBbits.IOCNB11
#define _IOCNB12 IOCNBbits.IOCNB12
#define _IOCNB13 IOCNBbits.IOCNB13
#define _IOCNB14 IOCNBbits.IOCNB14
#define _IOCNB15 IOCNBbits.IOCNB15

/* IOCFB */
#define _IOCFB0 IOCFBbits.IOCFB0
#define _IOCFB1 IOCFBbits.IOCFB1
#define _IOCFB2 IOCFBbits.IOCFB2
#define _IOCFB3 IOCFBbits.IOCFB3
#define _IOCFB4 IOCFBbits.IOCFB4
#define _IOCFB5 IOCFBbits.IOCFB5
#define _IOCFB6 IOCFBbits.IOCFB6
#define _IOCFB7 IOCFBbits.IOCFB7
#define _IOCFB8 IOCFBbits.IOCFB8
#define _IOCFB9 IOCFBbits.IOCFB9
#define _IOCFB10 IOCFBbits.IOCFB10
#define _IOCFB11 IOCFBbits.IOCFB11
#define _IOCFB12 IOCFBbits.IOCFB12
#define _IOCFB13 IOCFBbits.IOCFB13
#define _IOCFB14 IOCFBbits.IOCFB14
#define _IOCFB15 IOCFBbits.IOCFB15

/* CNPUB */
/* Bitname _IOCPB0 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB1 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB2 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB3 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB4 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB5 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB6 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB7 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB8 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB9 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB10 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB11 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB12 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB13 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB14 cannot be defined because it is used by more than one SFR */
/* Bitname _IOCPB15 cannot be defined because it is used by more than one SFR */
#define _IOCPUB0 CNPUBbits.IOCPUB0
#define _IOCPUB1 CNPUBbits.IOCPUB1
#define _IOCPUB2 CNPUBbits.IOCPUB2
#define _IOCPUB3 CNPUBbits.IOCPUB3
#define _IOCPUB4 CNPUBbits.IOCPUB4
#define _IOCPUB5 CNPUBbits.IOCPUB5
#define _IOCPUB6 CNPUBbits.IOCPUB6
#define _IOCPUB7 CNPUBbits.IOCPUB7
#define _IOCPUB8 CNPUBbits.IOCPUB8
#define _IOCPUB9 CNPUBbits.IOCPUB9
#define _IOCPUB10 CNPUBbits.IOCPUB10
#define _IOCPUB11 CNPUBbits.IOCPUB11
#define _IOCPUB12 CNPUBbits.IOCPUB12
#define _IOCPUB13 CNPUBbits.IOCPUB13
#define _IOCPUB14 CNPUBbits.IOCPUB14
#define _IOCPUB15 CNPUBbits.IOCPUB15
#define _CNPUB0 CNPUBbits.CNPUB0
#define _CNPUB1 CNPUBbits.CNPUB1
#define _CNPUB2 CNPUBbits.CNPUB2
#define _CNPUB3 CNPUBbits.CNPUB3
#define _CNPUB4 CNPUBbits.CNPUB4
#define _CNPUB5 CNPUBbits.CNPUB5
#define _CNPUB6 CNPUBbits.CNPUB6
#define _CNPUB7 CNPUBbits.CNPUB7
#define _CNPUB8 CNPUBbits.CNPUB8
#define _CNPUB9 CNPUBbits.CNPUB9
#define _CNPUB10 CNPUBbits.CNPUB10
#define _CNPUB11 CNPUBbits.CNPUB11
#define _CNPUB12 CNPUBbits.CNPUB12
#define _CNPUB13 CNPUBbits.CNPUB13
#define _CNPUB14 CNPUBbits.CNPUB14
#define _CNPUB15 CNPUBbits.CNPUB15

