MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
#define _CLKDIV_DOZEN_POSITION                   0x0000000B
#define _CLKDIV_DOZEN_MASK                       0x00000800
#define _CLKDIV_DOZEN_LENGTH                     0x00000001

#define _CLKDIV_DOZE_POSITION                    0x0000000C
#define _CLKDIV_DOZE_MASK                        0x00007000
#define _CLKDIV_DOZE_LENGTH                      0x00000003

#define _CLKDIV_ROI_POSITION                     0x0000000F
#define _CLKDIV_ROI_MASK                         0x00008000
#define _CLKDIV_ROI_LENGTH                       0x00000001

#define _CLKDIV_CPDIV0_POSITION                  0x00000006
#define _CLKDIV_CPDIV0_MASK                      0x00000040
#define _CLKDIV_CPDIV0_LENGTH                    0x00000001

#define _CLKDIV_CPDIV1_POSITION                  0x00000007
#define _CLKDIV_CPDIV1_MASK                      0x00000080
#define _CLKDIV_CPDIV1_LENGTH                    0x00000001

#define _CLKDIV_RCDIV0_POSITION                  0x00000008
#define _CLKDIV_RCDIV0_MASK                      0x00000100
#define _CLKDIV_RCDIV0_LENGTH                    0x00000001

#define _CLKDIV_RCDIV1_POSITION                  0x00000009
#define _CLKDIV_RCDIV1_MASK                      0x00000200
#define _CLKDIV_RCDIV1_LENGTH                    0x00000001

#define _CLKDIV_RCDIV2_POSITION                  0x0000000A
#define _CLKDIV_RCDIV2_MASK                      0x00000400
#define _CLKDIV_RCDIV2_LENGTH                    0x00000001

#define _CLKDIV_DOZE0_POSITION                   0x0000000C
#define _CLKDIV_DOZE0_MASK                       0x00001000
#define _CLKDIV_DOZE0_LENGTH                     0x00000001

#define _CLKDIV_DOZE1_POSITION                   0x0000000D
#define _CLKDIV_DOZE1_MASK                       0x00002000
#define _CLKDIV_DOZE1_LENGTH                     0x00000001

#define _CLKDIV_DOZE2_POSITION                   0x0000000E
#define _CLKDIV_DOZE2_MASK                       0x00004000
#define _CLKDIV_DOZE2_LENGTH                     0x00000001

#define _OSCTUN_TUN_POSITION                     0x00000000
#define _OSCTUN_TUN_MASK                         0x0000003F
#define _OSCTUN_TUN_LENGTH                       0x00000006

#define _OSCTUN_STORPOL_POSITION                 0x00000008
#define _OSCTUN_STORPOL_MASK                     0x00000100
#define _OSCTUN_STORPOL_LENGTH                   0x00000001

#define _OSCTUN_STOR_POSITION                    0x00000009
#define _OSCTUN_STOR_MASK                        0x00000200
#define _OSCTUN_STOR_LENGTH                      0x00000001

#define _OSCTUN_STLPOL_POSITION                  0x0000000A
#define _OSCTUN_STLPOL_MASK                      0x00000400
#define _OSCTUN_STLPOL_LENGTH                    0x00000001

#define _OSCTUN_STLOCK_POSITION                  0x0000000B
#define _OSCTUN_STLOCK_MASK                      0x00000800
#define _OSCTUN_STLOCK_LENGTH                    0x00000001

#define _OSCTUN_STSRC_POSITION                   0x0000000C
#define _OSCTUN_STSRC_MASK                       0x00001000
#define _OSCTUN_STSRC_LENGTH                     0x00000001

#define _OSCTUN_STSIDL_POSITION                  0x0000000D
#define _OSCTUN_STSIDL_MASK                      0x00002000
#define _OSCTUN_STSIDL_LENGTH                    0x00000001

#define _OSCTUN_STEN_POSITION                    0x0000000F
#define _OSCTUN_STEN_MASK                        0x00008000
#define _OSCTUN_STEN_LENGTH                      0x00000001

#define _OSCTUN_TUN0_POSITION                    0x00000000
#define _OSCTUN_TUN0_MASK                        0x00000001
#define _OSCTUN_TUN0_LENGTH                      0x00000001

#define _OSCTUN_TUN1_POSITION                    0x00000001
#define _OSCTUN_TUN1_MASK                        0x00000002
#define _OSCTUN_TUN1_LENGTH                      0x00000001

#define _OSCTUN_TUN2_POSITION                    0x00000002
#define _OSCTUN_TUN2_MASK                        0x00000004
#define _OSCTUN_TUN2_LENGTH                      0x00000001

#define _OSCTUN_TUN3_POSITION                    0x00000003
#define _OSCTUN_TUN3_MASK                        0x00000008
#define _OSCTUN_TUN3_LENGTH                      0x00000001

#define _OSCTUN_TUN4_POSITION                    0x00000004
#define _OSCTUN_TUN4_MASK                        0x00000010
#define _OSCTUN_TUN4_LENGTH                      0x00000001

#define _OSCTUN_TUN5_POSITION                    0x00000005
#define _OSCTUN_TUN5_MASK                        0x00000020
#define _OSCTUN_TUN5_LENGTH                      0x00000001

#define _DCOTUN_DCOTUN_POSITION                  0x00000000
#define _DCOTUN_DCOTUN_MASK                      0x0000003F
#define _DCOTUN_DCOTUN_LENGTH                    0x00000006

#define _DCOTUN_TUN0_POSITION                    0x00000000
#define _DCOTUN_TUN0_MASK                        0x00000001
#define _DCOTUN_TUN0_LENGTH                      0x00000001

#define _DCOTUN_TUN1_POSITION                    0x00000001
#define _DCOTUN_TUN1_MASK                        0x00000002
#define _DCOTUN_TUN1_LENGTH                      0x00000001

#define _DCOTUN_TUN2_POSITION                    0x00000002
#define _DCOTUN_TUN2_MASK                        0x00000004
#define _DCOTUN_TUN2_LENGTH                      0x00000001

#define _DCOTUN_TUN3_POSITION                    0x00000003
#define _DCOTUN_TUN3_MASK                        0x00000008
#define _DCOTUN_TUN3_LENGTH                      0x00000001

#define _DCOTUN_TUN4_POSITION                    0x00000004
#define _DCOTUN_TUN4_MASK                        0x00000010
#define _DCOTUN_TUN4_LENGTH                      0x00000001

#define _DCOTUN_TUN5_POSITION                    0x00000005
#define _DCOTUN_TUN5_MASK                        0x00000020
#define _DCOTUN_TUN5_LENGTH                      0x00000001

#define _DCOCON_DCOFSEL_POSITION                 0x00000008
#define _DCOCON_DCOFSEL_MASK                     0x00000F00
#define _DCOCON_DCOFSEL_LENGTH                   0x00000004

#define _DCOCON_DCOEN_POSITION                   0x0000000D
#define _DCOCON_DCOEN_MASK                       0x00002000
#define _DCOCON_DCOEN_LENGTH                     0x00000001

#define _DCOCON_DCOFSEL0_POSITION                0x00000008
#define _DCOCON_DCOFSEL0_MASK                    0x00000100
#define _DCOCON_DCOFSEL0_LENGTH                  0x00000001

#define _DCOCON_DCOFSEL1_POSITION                0x00000009
#define _DCOCON_DCOFSEL1_MASK                    0x00000200
#define _DCOCON_DCOFSEL1_LENGTH                  0x00000001

#define _DCOCON_DCOFSEL2_POSITION                0x0000000A
#define _DCOCON_DCOFSEL2_MASK                    0x00000400
#define _DCOCON_DCOFSEL2_LENGTH                  0x00000001

#define _DCOCON_DCOFSEL3_POSITION                0x0000000B
#define _DCOCON_DCOFSEL3_MASK                    0x00000800
#define _DCOCON_DCOFSEL3_LENGTH                  0x00000001

#define _OSCDIV_DIV_POSITION                     0x00000000
#define _OSCDIV_DIV_MASK                         0x00007FFF
#define _OSCDIV_DIV_LENGTH                       0x0000000F

