MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
#define _IOCNA_IOCNA1_POSITION                   0x00000001
#define _IOCNA_IOCNA1_MASK                       0x00000002
#define _IOCNA_IOCNA1_LENGTH                     0x00000001

#define _IOCNA_IOCNA2_POSITION                   0x00000002
#define _IOCNA_IOCNA2_MASK                       0x00000004
#define _IOCNA_IOCNA2_LENGTH                     0x00000001

#define _IOCNA_IOCNA3_POSITION                   0x00000003
#define _IOCNA_IOCNA3_MASK                       0x00000008
#define _IOCNA_IOCNA3_LENGTH                     0x00000001

#define _IOCNA_IOCNA4_POSITION                   0x00000004
#define _IOCNA_IOCNA4_MASK                       0x00000010
#define _IOCNA_IOCNA4_LENGTH                     0x00000001

#define _IOCNA_IOCNA7_POSITION                   0x00000007
#define _IOCNA_IOCNA7_MASK                       0x00000080
#define _IOCNA_IOCNA7_LENGTH                     0x00000001

#define _IOCNA_IOCNA8_POSITION                   0x00000008
#define _IOCNA_IOCNA8_MASK                       0x00000100
#define _IOCNA_IOCNA8_LENGTH                     0x00000001

#define _IOCNA_IOCNA9_POSITION                   0x00000009
#define _IOCNA_IOCNA9_MASK                       0x00000200
#define _IOCNA_IOCNA9_LENGTH                     0x00000001

#define _IOCNA_IOCNA10_POSITION                  0x0000000A
#define _IOCNA_IOCNA10_MASK                      0x00000400
#define _IOCNA_IOCNA10_LENGTH                    0x00000001

#define _IOCNA_IOCNA11_POSITION                  0x0000000B
#define _IOCNA_IOCNA11_MASK                      0x00000800
#define _IOCNA_IOCNA11_LENGTH                    0x00000001

#define _IOCNA_IOCNA12_POSITION                  0x0000000C
#define _IOCNA_IOCNA12_MASK                      0x00001000
#define _IOCNA_IOCNA12_LENGTH                    0x00000001

#define _IOCNA_IOCNA13_POSITION                  0x0000000D
#define _IOCNA_IOCNA13_MASK                      0x00002000
#define _IOCNA_IOCNA13_LENGTH                    0x00000001

#define _IOCNA_IOCNA14_POSITION                  0x0000000E
#define _IOCNA_IOCNA14_MASK                      0x00004000
#define _IOCNA_IOCNA14_LENGTH                    0x00000001

#define _IOCFA_IOCFA0_POSITION                   0x00000000
#define _IOCFA_IOCFA0_MASK                       0x00000001
#define _IOCFA_IOCFA0_LENGTH                     0x00000001

#define _IOCFA_IOCFA1_POSITION                   0x00000001
#define _IOCFA_IOCFA1_MASK                       0x00000002
#define _IOCFA_IOCFA1_LENGTH                     0x00000001

#define _IOCFA_IOCFA2_POSITION                   0x00000002
#define _IOCFA_IOCFA2_MASK                       0x00000004
#define _IOCFA_IOCFA2_LENGTH                     0x00000001

#define _IOCFA_IOCFA3_POSITION                   0x00000003
#define _IOCFA_IOCFA3_MASK                       0x00000008
#define _IOCFA_IOCFA3_LENGTH                     0x00000001

#define _IOCFA_IOCFA4_POSITION                   0x00000004
#define _IOCFA_IOCFA4_MASK                       0x00000010
#define _IOCFA_IOCFA4_LENGTH                     0x00000001

#define _IOCFA_IOCFA7_POSITION                   0x00000007
#define _IOCFA_IOCFA7_MASK                       0x00000080
#define _IOCFA_IOCFA7_LENGTH                     0x00000001

#define _IOCFA_IOCFA8_POSITION                   0x00000008
#define _IOCFA_IOCFA8_MASK                       0x00000100
#define _IOCFA_IOCFA8_LENGTH                     0x00000001

#define _IOCFA_IOCFA9_POSITION                   0x00000009
#define _IOCFA_IOCFA9_MASK                       0x00000200
#define _IOCFA_IOCFA9_LENGTH                     0x00000001

#define _IOCFA_IOCFA10_POSITION                  0x0000000A
#define _IOCFA_IOCFA10_MASK                      0x00000400
#define _IOCFA_IOCFA10_LENGTH                    0x00000001

#define _IOCFA_IOCFA11_POSITION                  0x0000000B
#define _IOCFA_IOCFA11_MASK                      0x00000800
#define _IOCFA_IOCFA11_LENGTH                    0x00000001

#define _IOCFA_IOCFA12_POSITION                  0x0000000C
#define _IOCFA_IOCFA12_MASK                      0x00001000
#define _IOCFA_IOCFA12_LENGTH                    0x00000001

#define _IOCFA_IOCFA13_POSITION                  0x0000000D
#define _IOCFA_IOCFA13_MASK                      0x00002000
#define _IOCFA_IOCFA13_LENGTH                    0x00000001

#define _IOCFA_IOCFA14_POSITION                  0x0000000E
#define _IOCFA_IOCFA14_MASK                      0x00004000
#define _IOCFA_IOCFA14_LENGTH                    0x00000001

#define _CNPUA_IOCPA0_POSITION                   0x00000000
#define _CNPUA_IOCPA0_MASK                       0x00000001
#define _CNPUA_IOCPA0_LENGTH                     0x00000001

#define _CNPUA_IOCPA1_POSITION                   0x00000001
#define _CNPUA_IOCPA1_MASK                       0x00000002
#define _CNPUA_IOCPA1_LENGTH                     0x00000001

#define _CNPUA_IOCPA2_POSITION                   0x00000002
#define _CNPUA_IOCPA2_MASK                       0x00000004
#define _CNPUA_IOCPA2_LENGTH                     0x00000001

#define _CNPUA_IOCPA3_POSITION                   0x00000003
#define _CNPUA_IOCPA3_MASK                       0x00000008
#define _CNPUA_IOCPA3_LENGTH                     0x00000001

#define _CNPUA_IOCPA4_POSITION                   0x00000004
#define _CNPUA_IOCPA4_MASK                       0x00000010
#define _CNPUA_IOCPA4_LENGTH                     0x00000001

#define _CNPUA_IOCPA7_POSITION                   0x00000007
#define _CNPUA_IOCPA7_MASK                       0x00000080
#define _CNPUA_IOCPA7_LENGTH                     0x00000001

#define _CNPUA_IOCPA8_POSITION                   0x00000008
#define _CNPUA_IOCPA8_MASK                       0x00000100
#define _CNPUA_IOCPA8_LENGTH                     0x00000001

#define _CNPUA_IOCPA9_POSITION                   0x00000009
#define _CNPUA_IOCPA9_MASK                       0x00000200
#define _CNPUA_IOCPA9_LENGTH                     0x00000001

#define _CNPUA_IOCPA10_POSITION                  0x0000000A
#define _CNPUA_IOCPA10_MASK                      0x00000400
#define _CNPUA_IOCPA10_LENGTH                    0x00000001

#define _CNPUA_IOCPA11_POSITION                  0x0000000B
#define _CNPUA_IOCPA11_MASK                      0x00000800
#define _CNPUA_IOCPA11_LENGTH                    0x00000001

#define _CNPUA_IOCPA12_POSITION                  0x0000000C
#define _CNPUA_IOCPA12_MASK                      0x00001000
#define _CNPUA_IOCPA12_LENGTH                    0x00000001

#define _CNPUA_IOCPA13_POSITION                  0x0000000D
#define _CNPUA_IOCPA13_MASK                      0x00002000
#define _CNPUA_IOCPA13_LENGTH                    0x00000001

#define _CNPUA_IOCPA14_POSITION                  0x0000000E
#define _CNPUA_IOCPA14_MASK                      0x00004000
#define _CNPUA_IOCPA14_LENGTH                    0x00000001

#define _CNPUA_IOCPUA0_POSITION                  0x00000000
#define _CNPUA_IOCPUA0_MASK                      0x00000001
#define _CNPUA_IOCPUA0_LENGTH                    0x00000001

#define _CNPUA_IOCPUA1_POSITION                  0x00000001
#define _CNPUA_IOCPUA1_MASK                      0x00000002
#define _CNPUA_IOCPUA1_LENGTH                    0x00000001

#define _CNPUA_IOCPUA2_POSITION                  0x00000002
#define _CNPUA_IOCPUA2_MASK                      0x00000004
#define _CNPUA_IOCPUA2_LENGTH                    0x00000001

#define _CNPUA_IOCPUA3_POSITION                  0x00000003
#define _CNPUA_IOCPUA3_MASK                      0x00000008
#define _CNPUA_IOCPUA3_LENGTH                    0x00000001

