MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
#define _CNPUA_IOCPUA4_POSITION                  0x00000004
#define _CNPUA_IOCPUA4_MASK                      0x00000010
#define _CNPUA_IOCPUA4_LENGTH                    0x00000001

#define _CNPUA_IOCPUA7_POSITION                  0x00000007
#define _CNPUA_IOCPUA7_MASK                      0x00000080
#define _CNPUA_IOCPUA7_LENGTH                    0x00000001

#define _CNPUA_IOCPUA8_POSITION                  0x00000008
#define _CNPUA_IOCPUA8_MASK                      0x00000100
#define _CNPUA_IOCPUA8_LENGTH                    0x00000001

#define _CNPUA_IOCPUA9_POSITION                  0x00000009
#define _CNPUA_IOCPUA9_MASK                      0x00000200
#define _CNPUA_IOCPUA9_LENGTH                    0x00000001

#define _CNPUA_IOCPUA10_POSITION                 0x0000000A
#define _CNPUA_IOCPUA10_MASK                     0x00000400
#define _CNPUA_IOCPUA10_LENGTH                   0x00000001

#define _CNPUA_IOCPUA11_POSITION                 0x0000000B
#define _CNPUA_IOCPUA11_MASK                     0x00000800
#define _CNPUA_IOCPUA11_LENGTH                   0x00000001

#define _CNPUA_IOCPUA12_POSITION                 0x0000000C
#define _CNPUA_IOCPUA12_MASK                     0x00001000
#define _CNPUA_IOCPUA12_LENGTH                   0x00000001

#define _CNPUA_IOCPUA13_POSITION                 0x0000000D
#define _CNPUA_IOCPUA13_MASK                     0x00002000
#define _CNPUA_IOCPUA13_LENGTH                   0x00000001

#define _CNPUA_IOCPUA14_POSITION                 0x0000000E
#define _CNPUA_IOCPUA14_MASK                     0x00004000
#define _CNPUA_IOCPUA14_LENGTH                   0x00000001

#define _CNPUA_CNPUA0_POSITION                   0x00000000
#define _CNPUA_CNPUA0_MASK                       0x00000001
#define _CNPUA_CNPUA0_LENGTH                     0x00000001

#define _CNPUA_CNPUA1_POSITION                   0x00000001
#define _CNPUA_CNPUA1_MASK                       0x00000002
#define _CNPUA_CNPUA1_LENGTH                     0x00000001

#define _CNPUA_CNPUA2_POSITION                   0x00000002
#define _CNPUA_CNPUA2_MASK                       0x00000004
#define _CNPUA_CNPUA2_LENGTH                     0x00000001

#define _CNPUA_CNPUA3_POSITION                   0x00000003
#define _CNPUA_CNPUA3_MASK                       0x00000008
#define _CNPUA_CNPUA3_LENGTH                     0x00000001

#define _CNPUA_CNPUA4_POSITION                   0x00000004
#define _CNPUA_CNPUA4_MASK                       0x00000010
#define _CNPUA_CNPUA4_LENGTH                     0x00000001

#define _CNPUA_CNPUA7_POSITION                   0x00000007
#define _CNPUA_CNPUA7_MASK                       0x00000080
#define _CNPUA_CNPUA7_LENGTH                     0x00000001

#define _CNPUA_CNPUA8_POSITION                   0x00000008
#define _CNPUA_CNPUA8_MASK                       0x00000100
#define _CNPUA_CNPUA8_LENGTH                     0x00000001

#define _CNPUA_CNPUA9_POSITION                   0x00000009
#define _CNPUA_CNPUA9_MASK                       0x00000200
#define _CNPUA_CNPUA9_LENGTH                     0x00000001

#define _CNPUA_CNPUA10_POSITION                  0x0000000A
#define _CNPUA_CNPUA10_MASK                      0x00000400
#define _CNPUA_CNPUA10_LENGTH                    0x00000001

#define _CNPUA_CNPUA11_POSITION                  0x0000000B
#define _CNPUA_CNPUA11_MASK                      0x00000800
#define _CNPUA_CNPUA11_LENGTH                    0x00000001

#define _CNPUA_CNPUA12_POSITION                  0x0000000C
#define _CNPUA_CNPUA12_MASK                      0x00001000
#define _CNPUA_CNPUA12_LENGTH                    0x00000001

#define _CNPUA_CNPUA13_POSITION                  0x0000000D
#define _CNPUA_CNPUA13_MASK                      0x00002000
#define _CNPUA_CNPUA13_LENGTH                    0x00000001

#define _CNPUA_CNPUA14_POSITION                  0x0000000E
#define _CNPUA_CNPUA14_MASK                      0x00004000
#define _CNPUA_CNPUA14_LENGTH                    0x00000001

#define _IOCPUA_IOCPA0_POSITION                  0x00000000
#define _IOCPUA_IOCPA0_MASK                      0x00000001
#define _IOCPUA_IOCPA0_LENGTH                    0x00000001

#define _IOCPUA_IOCPA1_POSITION                  0x00000001
#define _IOCPUA_IOCPA1_MASK                      0x00000002
#define _IOCPUA_IOCPA1_LENGTH                    0x00000001

#define _IOCPUA_IOCPA2_POSITION                  0x00000002
#define _IOCPUA_IOCPA2_MASK                      0x00000004
#define _IOCPUA_IOCPA2_LENGTH                    0x00000001

#define _IOCPUA_IOCPA3_POSITION                  0x00000003
#define _IOCPUA_IOCPA3_MASK                      0x00000008
#define _IOCPUA_IOCPA3_LENGTH                    0x00000001

#define _IOCPUA_IOCPA4_POSITION                  0x00000004
#define _IOCPUA_IOCPA4_MASK                      0x00000010
#define _IOCPUA_IOCPA4_LENGTH                    0x00000001

#define _IOCPUA_IOCPA7_POSITION                  0x00000007
#define _IOCPUA_IOCPA7_MASK                      0x00000080
#define _IOCPUA_IOCPA7_LENGTH                    0x00000001

#define _IOCPUA_IOCPA8_POSITION                  0x00000008
#define _IOCPUA_IOCPA8_MASK                      0x00000100
#define _IOCPUA_IOCPA8_LENGTH                    0x00000001

#define _IOCPUA_IOCPA9_POSITION                  0x00000009
#define _IOCPUA_IOCPA9_MASK                      0x00000200
#define _IOCPUA_IOCPA9_LENGTH                    0x00000001

#define _IOCPUA_IOCPA10_POSITION                 0x0000000A
#define _IOCPUA_IOCPA10_MASK                     0x00000400
#define _IOCPUA_IOCPA10_LENGTH                   0x00000001

#define _IOCPUA_IOCPA11_POSITION                 0x0000000B
#define _IOCPUA_IOCPA11_MASK                     0x00000800
#define _IOCPUA_IOCPA11_LENGTH                   0x00000001

#define _IOCPUA_IOCPA12_POSITION                 0x0000000C
#define _IOCPUA_IOCPA12_MASK                     0x00001000
#define _IOCPUA_IOCPA12_LENGTH                   0x00000001

#define _IOCPUA_IOCPA13_POSITION                 0x0000000D
#define _IOCPUA_IOCPA13_MASK                     0x00002000
#define _IOCPUA_IOCPA13_LENGTH                   0x00000001

#define _IOCPUA_IOCPA14_POSITION                 0x0000000E
#define _IOCPUA_IOCPA14_MASK                     0x00004000
#define _IOCPUA_IOCPA14_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA0_POSITION                 0x00000000
#define _IOCPUA_IOCPUA0_MASK                     0x00000001
#define _IOCPUA_IOCPUA0_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA1_POSITION                 0x00000001
#define _IOCPUA_IOCPUA1_MASK                     0x00000002
#define _IOCPUA_IOCPUA1_LENGTH                   0x00000001

