MikroElektronika/core_packages/dsPIC/XC16/def/PIC24FJ128GA705/mcu.h
#define _IOCPUA_IOCPUA2_POSITION                 0x00000002
#define _IOCPUA_IOCPUA2_MASK                     0x00000004
#define _IOCPUA_IOCPUA2_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA3_POSITION                 0x00000003
#define _IOCPUA_IOCPUA3_MASK                     0x00000008
#define _IOCPUA_IOCPUA3_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA4_POSITION                 0x00000004
#define _IOCPUA_IOCPUA4_MASK                     0x00000010
#define _IOCPUA_IOCPUA4_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA7_POSITION                 0x00000007
#define _IOCPUA_IOCPUA7_MASK                     0x00000080
#define _IOCPUA_IOCPUA7_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA8_POSITION                 0x00000008
#define _IOCPUA_IOCPUA8_MASK                     0x00000100
#define _IOCPUA_IOCPUA8_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA9_POSITION                 0x00000009
#define _IOCPUA_IOCPUA9_MASK                     0x00000200
#define _IOCPUA_IOCPUA9_LENGTH                   0x00000001

#define _IOCPUA_IOCPUA10_POSITION                0x0000000A
#define _IOCPUA_IOCPUA10_MASK                    0x00000400
#define _IOCPUA_IOCPUA10_LENGTH                  0x00000001

#define _IOCPUA_IOCPUA11_POSITION                0x0000000B
#define _IOCPUA_IOCPUA11_MASK                    0x00000800
#define _IOCPUA_IOCPUA11_LENGTH                  0x00000001

#define _IOCPUA_IOCPUA12_POSITION                0x0000000C
#define _IOCPUA_IOCPUA12_MASK                    0x00001000
#define _IOCPUA_IOCPUA12_LENGTH                  0x00000001

#define _IOCPUA_IOCPUA13_POSITION                0x0000000D
#define _IOCPUA_IOCPUA13_MASK                    0x00002000
#define _IOCPUA_IOCPUA13_LENGTH                  0x00000001

#define _IOCPUA_IOCPUA14_POSITION                0x0000000E
#define _IOCPUA_IOCPUA14_MASK                    0x00004000
#define _IOCPUA_IOCPUA14_LENGTH                  0x00000001

#define _IOCPUA_CNPUA0_POSITION                  0x00000000
#define _IOCPUA_CNPUA0_MASK                      0x00000001
#define _IOCPUA_CNPUA0_LENGTH                    0x00000001

#define _IOCPUA_CNPUA1_POSITION                  0x00000001
#define _IOCPUA_CNPUA1_MASK                      0x00000002
#define _IOCPUA_CNPUA1_LENGTH                    0x00000001

#define _IOCPUA_CNPUA2_POSITION                  0x00000002
#define _IOCPUA_CNPUA2_MASK                      0x00000004
#define _IOCPUA_CNPUA2_LENGTH                    0x00000001

#define _IOCPUA_CNPUA3_POSITION                  0x00000003
#define _IOCPUA_CNPUA3_MASK                      0x00000008
#define _IOCPUA_CNPUA3_LENGTH                    0x00000001

#define _IOCPUA_CNPUA4_POSITION                  0x00000004
#define _IOCPUA_CNPUA4_MASK                      0x00000010
#define _IOCPUA_CNPUA4_LENGTH                    0x00000001

#define _IOCPUA_CNPUA7_POSITION                  0x00000007
#define _IOCPUA_CNPUA7_MASK                      0x00000080
#define _IOCPUA_CNPUA7_LENGTH                    0x00000001

#define _IOCPUA_CNPUA8_POSITION                  0x00000008
#define _IOCPUA_CNPUA8_MASK                      0x00000100
#define _IOCPUA_CNPUA8_LENGTH                    0x00000001

#define _IOCPUA_CNPUA9_POSITION                  0x00000009
#define _IOCPUA_CNPUA9_MASK                      0x00000200
#define _IOCPUA_CNPUA9_LENGTH                    0x00000001

#define _IOCPUA_CNPUA10_POSITION                 0x0000000A
#define _IOCPUA_CNPUA10_MASK                     0x00000400
#define _IOCPUA_CNPUA10_LENGTH                   0x00000001

#define _IOCPUA_CNPUA11_POSITION                 0x0000000B
#define _IOCPUA_CNPUA11_MASK                     0x00000800
#define _IOCPUA_CNPUA11_LENGTH                   0x00000001

#define _IOCPUA_CNPUA12_POSITION                 0x0000000C
#define _IOCPUA_CNPUA12_MASK                     0x00001000
#define _IOCPUA_CNPUA12_LENGTH                   0x00000001

#define _IOCPUA_CNPUA13_POSITION                 0x0000000D
#define _IOCPUA_CNPUA13_MASK                     0x00002000
#define _IOCPUA_CNPUA13_LENGTH                   0x00000001

#define _IOCPUA_CNPUA14_POSITION                 0x0000000E
#define _IOCPUA_CNPUA14_MASK                     0x00004000
#define _IOCPUA_CNPUA14_LENGTH                   0x00000001

#define _CNPDA_IOCPDA0_POSITION                  0x00000000
#define _CNPDA_IOCPDA0_MASK                      0x00000001
#define _CNPDA_IOCPDA0_LENGTH                    0x00000001

#define _CNPDA_IOCPDA1_POSITION                  0x00000001
#define _CNPDA_IOCPDA1_MASK                      0x00000002
#define _CNPDA_IOCPDA1_LENGTH                    0x00000001

#define _CNPDA_IOCPDA2_POSITION                  0x00000002
#define _CNPDA_IOCPDA2_MASK                      0x00000004
#define _CNPDA_IOCPDA2_LENGTH                    0x00000001

#define _CNPDA_IOCPDA3_POSITION                  0x00000003
#define _CNPDA_IOCPDA3_MASK                      0x00000008
#define _CNPDA_IOCPDA3_LENGTH                    0x00000001

#define _CNPDA_IOCPDA4_POSITION                  0x00000004
#define _CNPDA_IOCPDA4_MASK                      0x00000010
#define _CNPDA_IOCPDA4_LENGTH                    0x00000001

#define _CNPDA_IOCPDA7_POSITION                  0x00000007
#define _CNPDA_IOCPDA7_MASK                      0x00000080
#define _CNPDA_IOCPDA7_LENGTH                    0x00000001

#define _CNPDA_IOCPDA8_POSITION                  0x00000008
#define _CNPDA_IOCPDA8_MASK                      0x00000100
#define _CNPDA_IOCPDA8_LENGTH                    0x00000001

#define _CNPDA_IOCPDA9_POSITION                  0x00000009
#define _CNPDA_IOCPDA9_MASK                      0x00000200
#define _CNPDA_IOCPDA9_LENGTH                    0x00000001

#define _CNPDA_IOCPDA10_POSITION                 0x0000000A
#define _CNPDA_IOCPDA10_MASK                     0x00000400
#define _CNPDA_IOCPDA10_LENGTH                   0x00000001

#define _CNPDA_IOCPDA11_POSITION                 0x0000000B
#define _CNPDA_IOCPDA11_MASK                     0x00000800
#define _CNPDA_IOCPDA11_LENGTH                   0x00000001

#define _CNPDA_IOCPDA12_POSITION                 0x0000000C
#define _CNPDA_IOCPDA12_MASK                     0x00001000
#define _CNPDA_IOCPDA12_LENGTH                   0x00000001

#define _CNPDA_IOCPDA13_POSITION                 0x0000000D
#define _CNPDA_IOCPDA13_MASK                     0x00002000
#define _CNPDA_IOCPDA13_LENGTH                   0x00000001

